package com.company;

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
//1.создать классы содержащие методы для подсчета площади прямоугольника
//     * квадарата и круга. Кроме результата подсчета должно выводиться также
//     * название соответствующей фигуры. Создать массив таких обьектов и вывести
//     * его на экран
//     * Прямоугольник1 имеет площкдь 50
//     * Круг имеет площадь 20
//     *
//2.написать игру Угадай число, в которой за ограниченное число попыток ввода числа
 //       * с клавиатуры нужно угадать секретное число от 0 до 9
 //       * Условия:
 //       * -Код игры должен находиться в классе GameGuessNumber
 ///       * -Класс GameGuessNumber должен содержать две статические переменные scanner для ввода чисел с
 //       * клавиатуры и secret, в которой записано секретное число
  //      * -Класс GameGuessNumber должен содержать следующие методы (могут быть и другие по
  //      * желанию): int readNumberOfAttempts()-считывает количество предоставляемых попыток
 //       *           int readNumber() - считывает вводимое число
 //       *           void guessNumber(int attempts) содержит логику игры
  //      */

//public class Shape {
///**
// * 1.создать классы содержащие методы для подсчета площади прямоугольника
// * квадарата и круга. Кроме результата подсчета должно выводиться также
// * название соответствующей фигуры. Создать массив таких обьектов и вывести
// * его на экран
// * Прямоугольник1 имеет площкдь 50
// * Круг имеет площадь 20
// */
//    private String displayName;
//
//    public Shape(String displayName){
//        this.displayName=displayName;
//    }
//
//    public String getDisplayName(){
//        return displayName;
//    }
//    public double getArea(){
//        return 0;
//    }
//}
