package task8;

public class Main_NotReady {
    //8. Используя Scanner написать программу, которая позволяет пользователю ввести с клавиатуры список Person {String name, MyDate birthday}
    //MyDate – класс {int day, int month, int year}. Программа должна корректно обрабатывать вводимые пользователем данные, проверять корректность данных и если данные некорректны,
    // запрашивать повторный ввод. Если пользователь ввел “finish”, программа должна распечатать получившийся список пользователей, отсортировав пользователей по возрасту,
    //  и завершить свое выполнение.
    public static void main(String[] args) {



    }


}
